[
  {
    "id": 6,
    "heading": "Création d'une page web dynamique",
    "image": "/images/projects/sophie-bluel/sophie-bluel.webp",
    "content": "J’ai créé une page web dynamique pour une architecte d’intérieur avec JavaScript et une API. J’ai manipulé le DOM, géré les événements, et ajouté une page de connexion administrateur ainsi qu’une modale pour l’upload de médias. Le projet a impliqué le développement de fonctionnalités from scratch et l’interaction avec un back-end.",
    "githubLink": "https://github.com/DyBryck/Projet-06-Sophie-Bluel",
    "tags": ["HTML", "CSS", "JavaScript"]
  },
  {
    "id": 7,
    "heading": "Premiers pas sur React avec React Router",
    "image": "/images/projects/kasa/kasa.webp",
    "content": "J’ai développé le front-end d’une application avec React et React Router pour une expérience utilisateur fluide. J’ai créé des composants React, configuré la navigation avec React Router, et utilisé des maquettes et des données JSON simulées. Avec Create React App pour démarrer et Node.js pour exécuter le code, j’ai structuré efficacement le projet et géré le routage.",
    "githubLink": "https://github.com/DyBryck/Projet-07-Kasa",
    "tags": ["React", "SASS"]
  },
  {
    "id": 8,
    "heading": "Optimisation du référencement et des performances d’un site web",
    "image": "/images/projects/nina-carducci/nina-carducci.webp",
    "content": "J’ai optimisé le référencement, la performance et l’accessibilité d’un site web. J’ai utilisé Lighthouse et Wave pour identifier les problèmes, proposé des recommandations, et modifié le code pour améliorer la vitesse et le référencement. J’ai créé un rapport comparatif avec des captures d’écran des audits, montrant l’impact des optimisations sur la performance et l’accessibilité.",
    "githubLink": "https://github.com/DyBryck/Projet-08-Nina-Carducci",
    "tags": ["HTML"]
  },
  {
    "id": 10,
    "heading": "Développement front-end d’une application",
    "image": "/images/projects/argent-bank/argent-bank.webp",
    "content": "J’ai développé le front-end d’une application bancaire avec React et Redux pour une expérience utilisateur dynamique. J’ai intégré le front-end au back-end via des appels API REST, créé un tableau de bord utilisateur responsive, et utilisé Redux pour la gestion de l’état global. Swagger a servi à définir les points d’accès de l’API, et Node.js a été utilisé pour le code côté serveur, offrant une gestion full-stack de l’application.",
    "githubLink": "https://github.com/DyBryck/Projet-10-ArgentBank",
    "tags": ["React", "Redux"]
  },
  {
    "id": 11,
    "heading": "Planification du développement d’un site web",
    "image": "/images/projects/menu-maker/menu-maker.webp",
    "content": "J’ai planifié le développement d’un site web. J’ai utilisé les maquettes, spécifications fonctionnelles et User Stories pour rédiger les spécifications techniques, identifier les besoins fonctionnels et décomposer les tâches. J’ai effectué une veille technologique, utilisé Notion pour créer un tableau Kanban de gestion de projet, et présenté la solution technique retenue.",
    "tags": ["Gestion de projet"]
  }
]
